answer-ls/Lummiss_Plant_Robot/src/demo/sdkconfig.defaults
# ESP32-P4 和开发板存储配置
CONFIG_IDF_TARGET="esp32p4"

# BLE Wi-Fi provisioning runs the NimBLE host on P4 and uses the C6
# controller through ESP-Hosted HCI over the existing SDIO link.
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_2=y
CONFIG_NETWORK_PROV_NETWORK_TYPE_WIFI=y
CONFIG_NETWORK_PROV_AUTOSTOP_TIMEOUT=5
CONFIG_NETWORK_PROV_BLE_SEC_CONN=y
# The current C6 runs ESP-Hosted 2.3.x while the P4 host uses 2.7.x. Stop
# advertising and disconnect the provisioning client after success, but keep
# the idle BLE stack alive until the C6 firmware is upgraded and teardown is
# revalidated with matching Host/Slave versions.
CONFIG_NETWORK_PROV_KEEP_BLE_ON_AFTER_PROV=y
CONFIG_NETWORK_PROV_DISCONNECT_AFTER_PROV=y
# 当前 JC1060P470C 开发板实测芯片为 ESP32-P4 v1.3。
# P4 v1.x 与 v3.x 的程序不兼容，必须选择低于 v3.0 的硬件分支。
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

# 开发板带 32 MB PSRAM，摄像头帧缓冲使用外部内存。
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=150000
# H.264 每帧回写约 720 KB 输入。分成 16 KB 缓存同步临界区，
# 避免 USB HCD 在另一核等待缓存锁时长时间无法服务 ISOC。
CONFIG_ESP_MM_CACHE_MSYNC_C2M_CHUNKED_OPS=y
CONFIG_ESP_MM_CACHE_MSYNC_C2M_CHUNKED_OPS_MAX_LEN=0x4000
# USB-DWC 内部 DMA 可访问 PSRAM：让 UVC 收流的 URB 数据缓冲落 PSRAM。
# 必须落 PSRAM：8 x 18432 B = 144 KiB，而内部 DMA 池只有 146 KiB
# （见启动日志 "Reserving pool of 146K of internal memory for DMA"）。codec-only
# 档位能刚好塞下，完整档位的 WiFi(SDIO)/LVGL/LCD SPI 会先占用该池，分配必然失败；
# 而分配失败又会被组件的 double-free 放大成开机重启循环（uvc_host.c:341 的
# uvc_transfers_free 释放后不置空，被 uvc_host_stream_open 的错误路径二次调用）。
# 代价是 6~10% UVC 丢帧；20 fps 门控下 30 fps 丢 10% 仍有约 27 fps，不影响帧率。
CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=y

# 为测试任务和 USB Host 保留足够栈空间及控制传输缓冲区。
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=4096
CONFIG_USB_HOST_HW_BUFFER_BIAS_IN=y
# 完整 USB/UVC 描述符有数百行，只在定位枚举兼容问题时临时打开。
CONFIG_PRINTF_UVC_CONFIGURATION_DESCRIPTOR=n

# LVGL 8 使用 RGB565；SPI 屏按高字节在前接收，因此在刷新前交换颜色字节。
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_SIMSUN_16_CJK=y
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_LV_BUILD_EXAMPLES=n

# 默认发送缓冲只有 5760 字节（= 4×MSS），一帧 H.264 约 17KB 装不下，一次
# esp_websocket_client_send_bin() 要分三个 RTT 才能推完（实测 WS=46.9ms ≈
# 3×15.6ms，正好对上）。改成 65535 后整帧一次进队列，耗时收敛到 1 个 RTT。
# 上限只能是 65535：LWIP_WND_SCALE 依赖 SPIRAM_TRY_ALLOCATE_WIFI_LWIP（未开），
# Kconfig 走 `range 2440 65535` 分支，写 65536 会被判非法。
# 段池 MEMP_NUM_TCP_SEG 默认 16 不构成限制——lwipopts.h 开了 MEMP_MEM_MALLOC，
# 池是堆分配、无数量上限，真正的闸门是 TCP_SND_BUF 和由它推出的 TCP_SND_QUEUELEN。
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535

# SD 卡 GIF 运行时解码：lv_gif/gifdec 解 320x180 需要约 230KB 画布，
# 超过 LVGL 内置堆的 128KB 上限，必须改走 malloc()（大块会落 PSRAM）。
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_USE_GIF=y
# lv_gif 通过 LVGL 文件系统读卡：用 POSIX 驱动（底层 fopen），
# 盘符 'S'，路径直接写 VFS 挂载点 /sdcard。
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=83
CONFIG_LV_FS_POSIX_PATH=""

# 卡上的素材目录是 expressions/，11 个字符超过 8.3；文件名 exp_01.gif 才是 8.3。
# 默认只认短名，按 "expressions" 打不开（FATFS 看到的是 EXPRESS~1）。
CONFIG_FATFS_LONG_FILENAMES=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# 板载 ESP32-C6 网络协处理器：ESP-Hosted 通过 SDIO Slot 1 通信。
# 引脚和时钟来自同型号 JC1060P470C 厂商的小智示例。
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=19
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=18
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=14
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=15
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=16
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=17
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_HOSTED_SLAVE_RESET_ON_EVERY_HOST_BOOTUP=y
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=54
CONFIG_ESP_HOSTED_USE_MEMPOOL=y

# ESP32-P4 使用远端 WiFi API，具体无线协议栈运行在 ESP32-C6 上。
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
